[
  {
    "name": "Manager Karen",
    "id": "#001",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Manager doesn't side with her",
      "Police",
      "Security Cameras"
    ],
    "strengths": [
      "Demands for manager",
      "Fake stories"
    ],
    "description": "This is your typical common Karen. You can always spot them out with their \"I want to speak to your manager\" haircut.\nWhen you see one these Karens, be ready for anything as there's always a 90% chance they will demand to speak with the manager."
  },
  {
    "name": "Scammer Karen",
    "id": "#002",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Witnesses",
      "Security Cameras."
    ],
    "strengths": [
      "Arguments",
      "Threat to sue."
    ],
    "description": "These Karens are known to injure their children to make it look like an accident, specifically inside a restaurant, after the child gets injured in a way that makes it seem like the restaurant's fault. The Karen will then attempt to sue the company for their scam whether they take it to court or simply call the police, but to no avail has any succeeded for their scam."
  },
  {
    "name": "Greedy Karen",
    "id": "#003",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Being poor"
    ],
    "strengths": [
      "Being rich"
    ],
    "description": "As the name suggests these Karens are simply known to be greedy. They will usually do whatever it takes to make them rich and will use their own children to do so."
  },
  {
    "name": "Angel Karen",
    "id": "#004",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Their angel getting in trouble"
    ],
    "strengths": [
      "Protection",
      "Denial"
    ],
    "description": "These Karens are known to defend their \"angels\" whether the child did something wrong like stealing, nearly killing someone, or injuring them. These Karens will always deny that it was their child's fault and say that they are in the right. They say the injured person is at fault for injuring themselves."
  },
  {
    "name": "Favoritism Karen",
    "id": "#005",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Children not her son getting something"
    ],
    "strengths": [
      "Favors their child."
    ],
    "description": "These Karens always make their children come first whether it's food or money while any other kid in the vicinity being under her supervision gets treated like dirt and gets barely anything."
  },
  {
    "name": "Discount Karen",
    "id": "#006",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Getting caught in the act"
    ],
    "strengths": [
      "Destroying products or damaging them."
    ],
    "description": "These Karens will always do anything in order to get a discount whether it's destroying the product or damaging it or ripping it and taking out a few pieces of the product to make it look like it's faulty. Some have gotten their ways with this, while others got either caught in the act or called out."
  },
  {
    "name": "Disabled Karen",
    "id": "#007",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Police",
      "Managers",
      "Security Cameras",
      "Witnesses"
    ],
    "strengths": [
      "Picking on disabled and stealing from them."
    ],
    "description": "Don't let the name get to you, these Karens aren't disabled, but rather pick on on the person who is disabled because they think they are faking it. There are times when a Disabled Karen tries to yank someone out of a wheelchair and claim they are disabled when an actual disabled person is in the disabled spot. Sometimes they try to take things that disabled people need in order to get through life."
  },
  {
    "name": "Thief Karen",
    "id": "#008",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Victim",
      "Security Cameras",
      "Witnesses"
    ],
    "strengths": [
      "Stealing",
      "Lying"
    ],
    "description": "These Karens are as common as Manager Karens except they're different. Thief Karens will try to steal someones property (money, phone, consoles, cars, and jewelry alike). These Karens are never alone though as their EK's are in the act too and they tend to use them in order to steal."
  },
  {
    "name": "Kidnap Karen",
    "id": "#009",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Mother/Father of the child",
      "Police",
      "Security Cameras"
    ],
    "strengths": [
      "Kidnapping"
    ],
    "description": "These Karens are quite rare as they will try to kidnap someone's child. Some have succeeded in doing this only to promptly get arrested and the child returned with their family. No one never knows why Karens try to kidnap children, but rumors states they do it because their child needs a brother/sister."
  },
  {
    "name": "Animal Abuser\nKaren",
    "id": "#010",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "Police"
    ],
    "strengths": [
      "Abusing animals"
    ],
    "description": "These Karens are known to be the worst. As the name implies they tend to abuse either their own animals or someone else's and actually think it's okay for them to do so."
  },
  {
    "name": "Legendary Karen",
    "id": "#011",
    "typeofpokemon": [
      "Karen"
    ],
    "weaknesses": [
      "???"
    ],
    "strengths": [
      "???"
    ],
    "description": "In the records barely anyone has ever crossed a Legendary Karen. When they do, they say she may look nice, and is entitled in a more... mannered way. These Karens are so hard to come by they barely exist."
  }
]